import React from 'react';

export const login_text = (
  <p>שלום, תודה שהסכמת להשתתף בניסוי.</p>
);

export const questions_text = {
  first_question: (
    <p>
      באיזו מידה הדובר השני (המיוצג על ידי שני הצלילים המסיימים) מסכים עם דבריו של הדובר הראשון (המיוצג ע"י האקורדים החוזרים)?
      <br/>
      בחרו בין האפשרויות: 9 - מסכים לחלוטין; 1 - מתנגד לחלוטין (ניתן להשתמש בכל דרגות הביניים).
    </p>
  ),

  ordered_questions: [
    <p>באיזו מידה בוטח הדובר השני בדובר הראשון (9 - בוטח מאד; 1 - לא בוטח בו כלל)?</p>,
    <p>באיזו מידה חש הדובר השני מתח למשמע דבריו של הדובר הראשון (9 - במידה רבה מאד; 1 - כלל לא)?</p>,
    <p>באיזו מידה כועס הדובר השני על הדובר הראשון (9 - כועס מאד; 1 - לא כועס כלל)?</p>,
    <p>
      באיזו מידה חש הדובר השני שהוא מעל או מתחת לדובר הראשון בהיררכיה חברתית (יותר חשוב או נחשב ממנו)?
      <br/>
      אם הדובר השני הרבה מעל לראשון בהיררכיה (הרבה יותר חשוב ממנו) - סמנו 9; הרבה מתחתיו - סמנו 1.
    </p>
  ],

  xy_question: (
    <p>
      בריבוע לפניך מתאר הציר האופקי (X) באיזו מידה רגשותיו של הדובר השני חיוביים (ימין) או שליליים (שמאל).
     הציר האנכי (Y) מתאר באיזו רמה הדובר השני מלא אנרגיה (למעלה) או חסר אנרגיה (למטה).
     ציין את מצבו הרגשי של הדובר השני ביחס לשני צירים אלו על ידי סימון נקודה (על ידי click) במיקום המתאים בריבוע.
    </p>
  ),

  taste_question: <p>איזה טעם עולה בפי הדובר השני? בחר מהרשימה.</p>
};

export const intro_texts = [(
  <React.Fragment>
    <p>שלום, ותודה שהסכמתם להשתתף בניסוי.</p>
    <p>ניסוי זה ייערך בשני מפגשים, כשהמפגש השני ייערך בין יומיים לשבוע לאחר הראשון ולא מעבר לכך. יש להתחיל כל אחד משני המפגשים רק לאחר יצירת קשר עם הנסיינ/ית וקבלת אישור ממנה. ביצוע הניסוי ללא אישור הנסיינ/ית יגרום לפסילתו. את מועד המפגש השני יש לתאם מראש עם הנסיינ/ית, וכאמור, להתחיל רק לאחר קבלת אישור.</p>
    <p>בתחילת הניסוי תבצעו שלב תרגול מקוון דרך זום, על ידי כך שתשתפו את מסך הניסוי עם הנסיין/ית. שיתוף המסך יעשה על ידכם (הנבדקים). לאחר שלב התרגול ינותק הקשר המקוון, אך הנסיינ/ית תהייה זמינה לפניותיכם במידה ותתעורר בעיה. אנא דווחו לנסיינ/ית על סיום הניסוי.</p>
    <p>לפני תחילת הניסוי, אנא וודאו שעומדים לרשותכם חלל שקט שבו תוכלו להשאר כשעה ללא הפרעה. אנא השקיטו הודעות, התראות ושיחות בטלפון הסלולרי ובמחשב עד סיום הניסוי (do not disturb).</p>
    <p>יש לבצע את הניסוי בעזרת מחשב נייח או נייד (לא בעזרת טלפון או טאבלט), בתצוגת מסך מלא (fullscreen). בניסוי עליכם לשבת מול מסך המחשב ולהשתמש באזניות המחוברות למחשב (השתמשו באזניות המפיקות איכות צליל סבירה לפחות). במהלך התרגול וודאו שהצלילים מגיעים אליכם בבירור, בעצמה נוחה (לא חלשה מאד, אך גם לא חזקה במידה שתעורר בכם אי נוחות), וללא רעשי לוואי או הפרעות אחרות. לאחר שקבעתם את העצמה הנוחה לכם, אל תשנו אותה עד לסיום הניסוי. סמנו לעצמכם איך כוון מד העצמה, כדי שתוכלו לכוונו לעוצמה זהה במפגש השני.</p>
    <p>במהלך הניסוי תוכלו לקחת הפסקות קצרות במידת הצורך, אך יש לבצע כל אחד משני המפגשים ברצף, ולא לפצלו. במהלך הפסקה (אם נלקחה) השאירו את הניסוי פתוח.</p>
    <p>משך מכסימלי של המפגש הנוכחי - 60 דקות. אין צורך למהר - משך זה מאפשר התנהלות נינוחה וקשובה, האזנות חוזרות, והפסקות קצרות, במידה ותזדקקו להן.</p>
  </React.Fragment>
), (
  <React.Fragment>
    <p>שלום - ברוכים הבאים למפגש השני של הניסוי.</p>
    <p>מפגש זה יש לבצע במועד שתואם מראש עם הנסיינ/ית ורק לאחר קבלת אישור ממנה.</p>
    <p>משך מכסימלי של המפגש הנוכחי - 90 דקות. אין צורך למהר - משך זה מאפשר התנהלות נינוחה וקשובה, האזנות חוזרות, והפסקות קצרות, במידה ותזדקקו להן.</p>
  </React.Fragment>
)];

export const first_experiment_intro = [
  (
    <React.Fragment>
      <p>ניסוי זה הוא מעין תרגיל ב"דמיון מודרך" בעזרת מוזיקה.</p>
      <p>בכל צעד בניסוי תשמעו קטע מוזיקאלי קצר ותתבקשו לענות על כמה שאלות אודותיו, כשאתם מדמים שהקטע הוא דיאלוג בין שני "דוברים".</p>
      <p>לכל אחד מן הקטעים שתשמעו שני חלקים: בחלק הראשון כמה אקורדים (אקורד - כמה צלילים המושמעים יחד), ובחלק השני - שני צלילים בודדים. דמו ששני חלקים אלו הם שני ה"דוברים" בדיאלוג:</p>
      <p>הדובר הראשון (סדרת האקורדים) מצהיר או טוען דבר מה, והדובר השני (שני הצלילים המסיימים) מגיב על דבריו.</p>
      <p>לשמיעת דוגמה של "דיאלוג" כזה, לחצו "נסה".</p>
    </React.Fragment>
  ),
  (
    <React.Fragment>
      <p>האם זיהיתם בבירור את שני הדוברים בדיאלוג?</p>
      <p>אם אינכם בטוחים בזיהוי, לחצו שוב. אם זיהיתם, לחצו "המשך" למעבר למסך הבא.</p>
    </React.Fragment>
  )
];

export const first_experiment_training_info = (
  <React.Fragment>
    <p>הקטע הראשון שתשמעו מיועד לתרגול.</p>
    <p>בתרגול יוצגו לכם השאלות שישאלו בניסוי, ותוכלו לפנות לנסיין אם משהו אינו ברור.</p>
    <p>לאחר תום התרגול יתנתק הנסיין (תוכלו ליצור אתו קשר במידה ותתעורר בעיה).</p>
    <p>כל השאלות שתישאלו מתייחסות לדובר השני בדיאלוג (המיוצג על ידי שני הצלילים המסיימים) - לתגובתו לדובר הראשון, לרגשותיו כלפיו, או למאפיינים שונים שלו. אף שאין לשאלות אלו תשובות "נכונות" או "שגויות" אובייקטיבית, נסו לדייק סובייקטיבית בתשובה - לבחור בתשובה המייצגת באופן המדויק ביותר את מה <strong>שמרגיש</strong> לכם "נכון" עבור הקטע ששמעתם.</p>
    <p>נסו לענות אינטואיטיבית, "מהבטן", ולא לנתח (במיוחד אם יש לכם השכלה מוזיקאלית!).</p>
    <p>אם אינכם בטוחים, ואם הקטע פג מזכרונכם לפני שעניתם על כל השאלות, לחצו על כפתור "השמע שוב" שבתחתית המסך (מומלץ לענות כשהקטע טרי בזכרון).</p>
    <p>בהאזנה ראשונה לכל קטע אנו ממליצים לעצום עיניים ולדמות את שני "הדוברים".</p>
    <p>לחצו "המשך" למעבר לתרגול.</p>
  </React.Fragment>
);

export const first_experiment_training_end = (
  <React.Fragment>
    <p>שלב התרגול נגמר. אם ישנן שאלות - אנא שאלו אותן כעת.</p>
    <p>כעת יש להתנתק מהזום ולהמשיך לעבוד על הניסוי באופן עצמאי. במקרה שיש שאלות יש ליצור קשר עם הנסיין/ית כפי שיסוכם כעת.</p>
    <br/>
    <p>אנא לחצו על כפתור ״המשך״ ברגע שהנסיין התנתק וסגרתם את הזום.</p>
  </React.Fragment>
);

export const first_experiment_pause = (
  <React.Fragment>
    <p>הפסקה קצרה: אנא הישארו במקומכם והקשיבו למוזיקה באמצעות האוזניות.</p>
    <br/>
    <p>בהפסקות מושמעים קטעי מוזיקה שונים. קטעים אלו אינם חלק מהניסוי, ואין להתייחס אליהם בתשובות. לאחר כל קטע תעברו לדיאלוג הבא.</p>
  </React.Fragment>
);

export const second_experiment_intro = (
  <React.Fragment>
    <p>בחלק זה של הניסוי תשמעו כמה קטעים מוזיקאליים הדומים לדיאלוגים שהושמעו במהלך הניסוי.</p>
    <p>בניגוד לחלקים הקודמים של הניסוי, הפעם לא תתבקשו לענות על שאלות מטפוריות אודות "דוברים", אלא על שאלה המתייחסת ישירות למאפיינים המוזיקאליים של כל קטע. השאלה (שתחזור עבור כל קטע שתשמעו היא:</p>
    <p>באיזו מידה מתאימים שני הצלילים המסיימים את הקטע (שכונה "הדובר השני" בחלקים הקודמים של הניסוי) לשמש כהמשך למוזיקה הקודמת להם (שכונתה "הדובר הראשון" בחלקים הקודמים של הניסוי)?</p>
    <p>9 - במידה רבה מאד; 1 - כלל לא (השתמשו בכל הסקאלה כדי לציין דרגות שונות של התאמה).</p>
    <p>אם הבנתם את השאלה - לחצו "המשך". אם משהו אינו ברור - צרו קשר עם הנסיין/ית.</p>
  </React.Fragment>
);

export const second_experiment_question = (
  <p>
    באיזו מידה מתאימים שני הצלילים המסיימים את הקטע לשמש כהמשך למוזיקה הקודמת להם?
    <br/>
    9 - במידה רבה מאד; 1 - כלל לא (השתמשו בכל הסקאלה כדי לציין דרגות שונות של התאמה).
  </p>
);

export const second_experiment_hear_again = (
  <p>אם ברצונכם לשמוע שוב את הקטע, לחצו "השמע". לאחר שעניתם, לחצו "המשך" למעבר למסך הבא.</p>
);

export const second_experiment_pause = <p>הפסקה קצרה: אנא הישארו במקומכם והקשיבו למוזיקה באמצעות האוזניות.</p>;

export const before_break_text = <p>הפסקה בת 10 דקות. אנא השאירו את מסך הניסוי פתוח וצרו קשר עם הנסיין/ית בתום ההפסקה.</p>;

export const after_break_text = <p>צרו קשר עם הנסיין/ית להנחיות נוספות. אין להתחיל בניסוי לפני קבלת אישור מהנסיין/ית.</p>;
